system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c6;

coordinateSystem global;

globalCoeffs
{
    e1              ( 1 0 0 );
    e2              ( 0 1 0 );
}

patchLocalCoeffs
{
    patch           outside;
    e1              ( 1 0 0 );
}

directions      ( e1 e2 );

useHexTopology  no;

geometricCut    yes;

writeMesh       no;


// ************************************************************************* //
