system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10 -8.0 -3) (10 0 3);
        }
    }
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-5 -6.0 -2.5) (9 0 2);
        }
    }
    {
        name    c3;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-3 -5.0 -1) (8 0 1.5);
        }
    }
    {
        name    c4;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-2 -4.0 -0.6) (7 0 1);
        }
    }
    {
        name    c5;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1 -3.0 -0.3) (6.5 0 0.8);
        }
    }

    {
        name    c6;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.5 -2.0 -0.2) (6.25 0 0.65);
        }
    }

  {
        name    c7;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.5 -1.0 -0.10) (5.0 0 0.55);
        }
    }

{
        name    c8;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (1.75 -0.5 0.0) (4.75 0 0.50);
        }
    }





);

// ************************************************************************* //
