Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh if necessary
#if ! cloneMesh ../DTCHullMoving . && ! (isTest $@ && cloneMesh ../DTCHullWave .)
#then
#    ./Allmesh
#fi

runApplication setFields

runApplication decomposePar -force

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
